##年份vs票房组别
年份<-c(rep(2010,58),rep(2011,63),rep(2012,70),rep(2013,75))
票房组别<-rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(3,13,42,2,14,47,3,16,51,7,24,44))
x3=cbind(年份,票房组别)
y=table(x3[,2],x3[,1])
barplot(y,beside = T,col=c("lightgreen","grey","pink"),xlab="年份",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)
 
##上映周数vs票房组别
x1=rep(c("1~13","14~26","27~39","40~53"),c(62,54,85,65))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(2,19,41,2,10,42,4,19,62,7,19,39))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = T,col=c("lightgreen","grey","pink"),xlab="上映周数",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)
barplot(b)

##宣发公司vs票房组别
x1=rep(c("国有宣发公司","联合发行","小私营公司","明星私企"),c(57,59,68,82))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(4,11,42,2,13,44,0,10,58,9,33,40))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = T,col=c("lightgreen","grey","pink"),xlab="宣发公司",ylab="频数")
legend("topleft",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)


####影片时长vs票房组别
x1=rep(c("076~095","096~115","116~135","136~156"),c(78,128,54,6))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(0,7,71,3,34,91,10,20,24,2,2,2))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = T,col=c("lightgreen","grey","pink"),xlab="影片时长",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)

#####是否改编vs票房组别
x1=rep(c("1","0"),c(25,241))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(6,10,9,9,57,175))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = T,col=c("lightgreen","grey","pink"),xlab="是否改编作品",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.7)

#####是否真人真事vs票房组别
x1=rep(c("0","1"),c(242,24))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(13,60,169,2,7,15))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = F,col=c("lightgreen","grey","pink"),xlab="是否真人真事",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)



#####是否翻拍作品vs票房组别
x1=rep(c("0","1"),c(240,26))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(14,54,172,1,13,12))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = F,col=c("lightgreen","grey","pink"),xlab="是否翻拍作品",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)



###是否作品续集vs票房组别
x1=rep(c("0","1"),c(223,43))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(10,55,158,5,12,26))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = F,col=c("lightgreen","grey","pink"),xlab="是否作品续集",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)

##导演是否得奖vs票房组别
x1=rep(c("0","1"),c(110,156))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(2,15,93,13,52,94))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = F,col=c("lightgreen","grey","pink"),xlab="导演是否得奖",ylab="频数")
legend("topleft",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)

##导演是否转型vs票房组别
x1=rep(c("0","1"),c(229,37))
x2=rep(c("a高票房组","b中票房组","c低票房组","a高票房组","b中票房组","c低票房组"),c(7,55,167,8,12,17))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
barplot(b,beside = F,col=c("lightgreen","grey","pink"),xlab="导演是否转型",ylab="频数")
legend("topright",legend=c("高票房组","中票房组","低票房组"),fill=c("lightgreen","grey","pink"),cex=0.5)



##导演年代vs票房组别
x1=rep(c("30年代","40年代","50年代","60年代","70年代","80年代"),c(1,3,67,106,77,12))
x2=rep(c("高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组")
       ,c(0,0,1,0,0,3,7,21,39,3,31,72,4,12,61,1,3,8))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
haireye.ca <- ca(b)
plot(haireye.ca)

##导演作品数量vs票房组别
x1=rep(c("1~10","11~20","21~30","31~40","41~50","51~60","61~70","71~80","81~90","91~100","101~110"),c(160,57,23,7,4,5,2,3,0,4,1))
x2=rep(c("高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组")
       ,c(7,33,120,5,16,36,1,9,13,0,5,2,2,0,2,0,2,3,0,1,1,0,0,3,0,0,0,0,1,3,0,0,1))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
haireye.ca <- ca(b)
plot(haireye.ca)

##上映月份vs票房组别
x1=rep(c("1月","2月","3月","4月","5月","6月","7月","8月","9月","10月","11月",
         "12月"),c(22,22,22,20,8,27,31,29,30,16,17,22))
x2=rep(c("高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组")
       ,c(0,11,11,1,6,15,1,2,19,1,7,12,1,0,7,2,3,22,1,6,24,0,7,22,1,10,19,
          0,2,14,0,6,11,7,7,8))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
haireye.ca <- ca(b)
plot(haireye.ca)

##影片类别vs票房组别
x1=rep(c("爱情","动画","动作","儿童","家庭伦理","惊悚","警匪","历史剧情","励志","魔幻","喜剧",
         "悬疑","灾难","主旋律"),c(63,23,43,4,6,27,18,12,4,11,36,6,3,10))
x2=rep(c("高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组",
         "高票房组","中票房组","低票房组","高票房组","中票房组","低票房组")
       ,c(4,13,46,0,4,19,4,18,21,0,0,4,0,0,6,0,0,27,0,7,11,1,5,6,1,0,3,2,6,3,2,7,27
          ,0,5,1,1,1,1,0,1,9))
x=cbind(x1,x2)
b=table(x[,2],x[,1])
haireye.ca <- ca(b)
plot(haireye.ca)


##聚类结果雷达图
maxmin <- data.frame(放映场数=c(5, 0),观影人数=c(5, 0),票房=c(5, 0))
library(fmsb)
radarchart(dat.A2, axistype=0, seg=5,centerzero = TRUE)
dat.AB <- data.frame(放映场数=c(3.2,0.42,1.38),观影人数=c(3.6,0.025,1.325),
                         票房=c(3.75,0.225,1.025))
dat.AB2<-rbind(maxmin,dat.AB)
radarchart(dat.AB2, col=c("red","yellow","green"))


##回归图
##放映场数
H<- c(31.03,3.704,-20.68,-42.6,9.127,2.744,-42.34,54.26,32.65,73.06,0.001133)
M <- c("上映年份","上映月份","宣发公司G","宣发公司L","宣发公司S","影片时长",
       "是改编作品","是作品续集","导演得奖","导演转型","百度指数1")
barplot(H,names.arg=M,xlab="预测变量",ylab="参数估计",
        col=c("red","red","black","red","black","red",
              "black","red","red","red","red"))
legend("topright",legend=c("显著","不显著"),fill=c("red","black"),cex=0.5)
##观影人数
H<- c(62.13,11.05,-38.45,-151.0,64.96,9.908,-210.7,232.8,138.1,329.9)
M <- c("上映年份","上映月份","宣发公司G","宣发公司L","宣发公司S","影片时长",
       "是改编作品","是作品续集","导演得奖","导演转型")
barplot(H,names.arg=M,xlab="预测变量",ylab="参数估计",
        col=c("red","black","black","red","black","red",
              "red","red","red","red"))
legend("topleft",legend=c("显著","不显著"),fill=c("red","black"),cex=0.5)


##票房
        
